PinguinoIDE/pinguino-compilers/windows32/p8/share/gputils/header/p16lf18877.inc
;----- IOCEF Bits -----------------------------------------------------
IOCEF3           EQU  H'0003'


;----- CCDNE Bits -----------------------------------------------------
CCDNE0           EQU  H'0000'
CCDNE1           EQU  H'0001'
CCDNE2           EQU  H'0002'


;----- CCDPE Bits -----------------------------------------------------
CCDPE0           EQU  H'0000'
CCDPE1           EQU  H'0001'
CCDPE2           EQU  H'0002'


;----- STATUS_SHAD Bits -----------------------------------------------------
C_SHAD           EQU  H'0000'
DC_SHAD          EQU  H'0001'
Z_SHAD           EQU  H'0002'



;==========================================================================
;
;       RAM Definitions
;
;==========================================================================
       __MAXRAM  H'1FEF'
       __BADRAM  H'001B'
       __BADRAM  H'0092'
       __BADRAM  H'009F'
       __BADRAM  H'0118'
       __BADRAM  H'0193'
       __BADRAM  H'0194'
       __BADRAM  H'0195'
       __BADRAM  H'019D'
       __BADRAM  H'019E'
       __BADRAM  H'019F'
       __BADRAM  H'029E'
       __BADRAM  H'029F'
       __BADRAM  H'038F'
       __BADRAM  H'0393'
       __BADRAM  H'0394'
       __BADRAM  H'0395'
       __BADRAM  H'0396'
       __BADRAM  H'0397'
       __BADRAM  H'0398'
       __BADRAM  H'0399'
       __BADRAM  H'039A'
       __BADRAM  H'039B'
       __BADRAM  H'039C'
       __BADRAM  H'039D'
       __BADRAM  H'039E'
       __BADRAM  H'039F'
       __BADRAM  H'0412'
       __BADRAM  H'0413'
       __BADRAM  H'0414'
       __BADRAM  H'0415'
       __BADRAM  H'049E'
       __BADRAM  H'049F'
       __BADRAM  H'051E'
       __BADRAM  H'051F'
       __BADRAM  H'0594'
       __BADRAM  H'0595'
       __BADRAM  H'0596'
       __BADRAM  H'0597'
       __BADRAM  H'0598'
       __BADRAM  H'0599'
       __BADRAM  H'059A'
       __BADRAM  H'059B'
       __BADRAM  H'059C'
       __BADRAM  H'059D'
       __BADRAM  H'059E'
       __BADRAM  H'059F'
       __BADRAM  H'0615'
       __BADRAM  H'061F'
       __BADRAM  H'0695'
       __BADRAM  H'0696'
       __BADRAM  H'0697'
       __BADRAM  H'0698'
       __BADRAM  H'0699'
       __BADRAM  H'069A'
       __BADRAM  H'069B'
       __BADRAM  H'069C'
       __BADRAM  H'069D'
       __BADRAM  H'069E'
       __BADRAM  H'069F'
       __BADRAM  H'06A0'-H'06EF'
       __BADRAM  H'0715'
       __BADRAM  H'071F'
       __BADRAM  H'078C'-H'0795'
       __BADRAM  H'079C'
       __BADRAM  H'079D'
       __BADRAM  H'079E'
       __BADRAM  H'079F'
       __BADRAM  H'0812'
       __BADRAM  H'0815'-H'0819'
       __BADRAM  H'0894'
       __BADRAM  H'089C'-H'089F'
       __BADRAM  H'090D'
       __BADRAM  H'0910'-H'0913'
       __BADRAM  H'0914'-H'091E'
       __BADRAM  H'098C'-H'098E'
       __BADRAM  H'0998'-H'099F'
       __BADRAM  H'0A0C'-H'0A1F'
       __BADRAM  H'0A20'-H'0A6F'
       __BADRAM  H'0A8C'-H'0A9F'
       __BADRAM  H'0AA0'-H'0AEF'
       __BADRAM  H'0B0C'-H'0B1F'
       __BADRAM  H'0B20'-H'0B6F'
       __BADRAM  H'0B8C'-H'0B9F'
       __BADRAM  H'0BA0'-H'0BEF'
       __BADRAM  H'0C0C'-H'0C1F'
       __BADRAM  H'0C20'-H'0C6F'
       __BADRAM  H'0C8C'-H'0C9F'
       __BADRAM  H'0CA0'-H'0CEF'
       __BADRAM  H'0D0C'-H'0D1F'
       __BADRAM  H'0D20'-H'0D6F'
       __BADRAM  H'0D8C'-H'0D9F'
       __BADRAM  H'0DA0'-H'0DEF'
       __BADRAM  H'0E0C'-H'0E0E'
       __BADRAM  H'0E0F'-H'0E1F'
       __BADRAM  H'0E20'-H'0E6F'
       __BADRAM  H'0E8C'-H'0E8E'
       __BADRAM  H'0E8F'-H'0E91'
       __BADRAM  H'0E92'-H'0E9F'
       __BADRAM  H'0EA0'-H'0EEF'
       __BADRAM  H'0F0C'-H'0F0F'
       __BADRAM  H'0F10'-H'0F11'
       __BADRAM  H'0F12'-H'0F1F'
       __BADRAM  H'0F20'-H'0F6F'
       __BADRAM  H'0F8C'-H'0F98'
       __BADRAM  H'0F99'-H'0F9C'
       __BADRAM  H'0F9D'-H'0F9F'
       __BADRAM  H'0FA0'-H'0FEF'
       __BADRAM  H'100C'-H'101F'
       __BADRAM  H'1020'-H'107F'
       __BADRAM  H'108C'-H'109F'
       __BADRAM  H'10A0'-H'10FF'
       __BADRAM  H'110C'-H'111F'
       __BADRAM  H'1120'-H'117F'
       __BADRAM  H'118C'-H'119F'
       __BADRAM  H'11A0'-H'11FF'
       __BADRAM  H'120C'-H'121F'
       __BADRAM  H'1220'-H'127F'
       __BADRAM  H'128C'-H'129F'
       __BADRAM  H'12A0'-H'12FF'
       __BADRAM  H'130C'-H'131F'
       __BADRAM  H'1320'-H'137F'
       __BADRAM  H'138C'-H'139F'
       __BADRAM  H'13A0'-H'13FF'
       __BADRAM  H'140C'-H'141F'
       __BADRAM  H'1420'-H'147F'
       __BADRAM  H'148C'-H'149F'
       __BADRAM  H'14A0'-H'14FF'
       __BADRAM  H'150C'-H'151F'
       __BADRAM  H'1520'-H'157F'
       __BADRAM  H'158C'-H'159F'
       __BADRAM  H'15A0'-H'15FF'
       __BADRAM  H'160C'-H'161F'
       __BADRAM  H'1620'-H'167F'
       __BADRAM  H'168C'-H'169F'
       __BADRAM  H'16A0'-H'16FF'
       __BADRAM  H'170C'-H'171F'
       __BADRAM  H'1720'-H'177F'
       __BADRAM  H'178C'-H'179F'
       __BADRAM  H'17A0'-H'17FF'
       __BADRAM  H'180C'-H'181F'
       __BADRAM  H'1820'-H'187F'
       __BADRAM  H'188C'-H'189F'
       __BADRAM  H'18A0'-H'18FF'
       __BADRAM  H'190C'-H'191F'
       __BADRAM  H'1920'-H'197F'
       __BADRAM  H'198C'-H'199F'
       __BADRAM  H'19A0'-H'19FF'
       __BADRAM  H'1A0C'-H'1A1F'
       __BADRAM  H'1A20'-H'1A7F'
       __BADRAM  H'1A8C'-H'1A9F'
       __BADRAM  H'1AA0'-H'1AFF'
       __BADRAM  H'1B0C'-H'1B1F'
       __BADRAM  H'1B20'-H'1B7F'
       __BADRAM  H'1B8C'-H'1B9F'
       __BADRAM  H'1BA0'-H'1BFF'
       __BADRAM  H'1C0C'-H'1C1F'
       __BADRAM  H'1C20'-H'1C7F'
       __BADRAM  H'1C8C'-H'1C9F'
       __BADRAM  H'1CA0'-H'1CFF'
       __BADRAM  H'1D0C'-H'1D1F'
       __BADRAM  H'1D20'-H'1D7F'
       __BADRAM  H'1D8C'-H'1D9F'
       __BADRAM  H'1DA0'-H'1DFF'
       __BADRAM  H'1E0C'-H'1E0E'
       __BADRAM  H'1E38'-H'1E6F'
       __BADRAM  H'1E70'-H'1E7F'
       __BADRAM  H'1E8C'-H'1E8E'
       __BADRAM  H'1E98'-H'1E9B'
       __BADRAM  H'1E9F'-H'1EA0'
       __BADRAM  H'1EA6'-H'1EA8'
       __BADRAM  H'1EAD'-H'1EB0'
       __BADRAM  H'1EB4'-H'1EB7'
       __BADRAM  H'1EBF'-H'1EC2'
       __BADRAM  H'1EC4'
       __BADRAM  H'1ECD'-H'1EDC'
       __BADRAM  H'1EDD'-H'1EDF'
       __BADRAM  H'1EE0'-H'1EEF'
       __BADRAM  H'1EF0'-H'1EFF'
       __BADRAM  H'1F0C'-H'1F0F'
       __BADRAM  H'1F33'-H'1F37'
       __BADRAM  H'1F42'
       __BADRAM  H'1F4D'
       __BADRAM  H'1F58'
       __BADRAM  H'1F5E'-H'1F60'
       __BADRAM  H'1F63'
       __BADRAM  H'1F6E'-H'1F6F'
       __BADRAM  H'1F70'-H'1F7F'
       __BADRAM  H'1F8C'
       __BADRAM  H'1F8D'-H'1F8F'
       __BADRAM  H'1F90'-H'1FAF'
       __BADRAM  H'1FB0'-H'1FCF'
       __BADRAM  H'1FD0'-H'1FD2'
       __BADRAM  H'1FD3'-H'1FD6'
       __BADRAM  H'1FD7'-H'1FE3'
       __BADRAM  H'1FEC'

